app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Sam"], ["email", "sam25@mail.com"], ["password", "sam"], ["updated_at", "2020-09-04 10:17:19.506477"], ["id", 9]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)